## Taps
tap 'homebrew/services'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'hashicorp/tap'
tap 'nicoverbruggen/cask'
tap 'romkatv/powerlevel10k'
tap 'stripe/stripe-cli'

## Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'iperf3'
brew 'k3sup'
brew 'mackup'
# brew 'mas' # Mac App Store manager
brew 'powerlevel10k'

## Development
# brew 'composer' # Managed via Herd
# brew 'dnsmasq'
brew 'imagemagick'
# brew 'mailhog' # Used Herd instead
# brew 'meilisearch' # Managed via Herd
# brew 'mysql' # Managed via Herd
# brew 'node' # Managed via Herd
# brew 'php' # Managed via Herd
# brew 'php@8.1' # Managed via Herd
# brew 'php@8.2' # Managed via Herd
brew 'pkg-config'
# brew 'redis' # Managed via Herd
# brew 'smartmontools'
brew 'sshpass'
brew 'stripe/stripe-cli/stripe'
brew 'telnet'
brew 'wp-cli'
brew 'yarn'

## Infrastructure
brew 'ansible'
brew 'hashicorp/tap/terraform'
brew 'helm'

## Music / video
brew 'ffmpeg'

## Apps
cask '1password'
cask 'audacity'
cask 'balenaetcher'
cask 'chatgpt'
cask 'clickup'
cask 'cyberduck'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'github'
cask 'google-chrome'
cask 'herd'
cask 'iterm2'
cask 'musescore'
cask 'notion'
cask 'postman'
cask 'prusaslicer'
cask 'raspberry-pi-imager'
cask 'ray'
cask 'raycast'
cask 'shapr3d'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'tiptoi-manager'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'xnapper'
cask 'zoom'

cask 'microsoft-excel'
cask 'microsoft-word'
cask 'microsoft-powerpoint'
cask 'microsoft-onenote'
cask 'microsoft-teams'

## Fonts
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

## Mac App Store
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
