## Taps
tap 'homebrew/services'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'hashicorp/tap'
tap 'nicoverbruggen/cask'
tap 'romkatv/powerlevel10k'
tap 'stripe/stripe-cli'

## Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'mackup'
# brew 'mas' # Mac App Store manager
brew 'powerlevel10k'
brew 'iperf'
brew 'iperf3'
brew 'stripe/stripe-cli/stripe'

## Development
brew 'php'
brew 'php@8.1'
brew 'php@8.2'
brew 'composer'
brew 'imagemagick'
brew 'pkg-config'
# brew 'meilisearch'
brew 'mysql'
brew 'node'
# brew 'redis'
# brew 'yarn'
brew 'dnsmasq'
brew 'mailhog'
brew 'nginx'
brew 'smartmontools'
brew 'telnet'

## Infrastructure
brew 'hashicorp/tap/terraform'
brew 'ansible'
brew 'helm'

## Music / video
brew 'ffmpeg'
brew 'handbrake'

## Apps
cask '1password7'
cask 'balenaetcher'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'fig'
cask 'github'
cask 'google-chrome'
cask 'iterm2'
cask 'notion'
cask 'phpmon'
cask 'ray'
cask 'raycast'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'postman'
cask 'prusaslicer'
cask 'raspberry-pi-imager'
cask 'zoom'
cask 'arc'
cask 'musescore'
cask 'audacity'

cask 'microsoft-excel'
cask 'microsoft-word'
cask 'microsoft-powerpoint'
cask 'microsoft-onenote'

## Fonts
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

## Mac App Store
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
